# GenericZoneDomainData Class

---
A base class for specific domain requirements for a generic zone.
SystemObject Autodesk.Revit.DB.AnalysisGenericZoneDomainData Autodesk.Revit.DB.MechanicalSystemZoneData
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class GenericZoneDomainData : IDisposable

    Public Class GenericZoneDomainData
    	Implements IDisposable

    public ref class GenericZoneDomainData : IDisposable

    type GenericZoneDomainData =
        class
            interface IDisposable
        end
The GenericZoneDomainData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the GenericZoneDomainData
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace